/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

本题定义了一个长度为10的boolean型数组，并给数组元素赋值，
要求如果数组元素下票为奇数的话，数组元素值为false，否则为true。

-------------------------------------------------------*/


public class Prog1{        

public static void main(String[] args) {
/***********SPACE***********/
        boolean b[] = new boolean[10];

        for(int i=0;i<10;i++){
/***********SPACE***********/
                if(i%2!=0)

                        b[i]=false;

                else
/***********SPACE***********/
                        b[i]=true;

        }

        for(int i=0;i<10;i++)

                System.out.print("b["+i+"]="+b[i]+",");

}        

}
