/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：求100到200之间的素数，并以5个一行的形式显示在屏幕上

-------------------------------------------------------*/

public class Prog1
{
    /***************FOUND***************/
  public static void main(String args[])
    { int n=0,j; 
      for(int i=101;i<200;i+=2)
       {  
    /***************FOUND***************/
           for( j=2;j<=i-1;j++)
    /***************FOUND***************/
             if( i%j==0 ) 
                  break; 
           if (j>i-1)       
            { System.out.print(" "+i); 
              n++; 
              if( n==5 ) 
                {
    /***************FOUND***************/
                 System.out.println(); 
                 n=0; 
                }
            }
        } 
     System.out.println(); 
    } 
}
