/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：水仙花是指其各位、十位和百位的立方和等于这个三位数本
      身的数，求出所有的水仙花数

-------------------------------------------------------*/

public class Prog1
{
    /***********FOUND***********/
  public static void main(String args[])
    { int n,i,j,k; 
    /***********FOUND***********/
      for(n=100;n<1000;n++)
        {  
    /***********FOUND***********/
          i=n%10;
          j=n/10%10;
          k=n/100;
    /***********FOUND***********/
          if (n==i*i*i+j*j*j+k*k*k)
            System.out.print(n+"  ");  
          } 
       System.out.println(); 
    } 
}

