/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：计算斐波纳契数列的前20项，并以每行5项的形式输出。
      (斐波纳契数列的第一项为0，第二项为1，其后各项依
      次为相临前两项之和，即0，1，1，2，3，5，8...)

-------------------------------------------------------*/

public class Prog1
{
  public static void main(String args[])
    { int f1,f2,f3,i;
    /***********FOUND***********/
      f1=0;
      f2=1;
    /***********FOUND***********/
      System.out.print(f1+"  "+f2+"  ");
      for (i=3;i<=20;i++)
        {f3=f1+f2;
         System.out.print(f3+"  ");
    /***********FOUND***********/
         if (i%5==0)
            System.out.println();
         f1=f2;
    /***********FOUND***********/
         f2=f3;
        }      
    } 
}
