/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

本题利用递归方法求前n个自然数的和（n=10）。

-------------------------------------------------------*/


public class Prog1{        

public static void main(String[] args) {

        int sum=add(10);

        System.out.println("1+2+...+9+10="+sum);                

}
/***********SPACE***********/
public static int add(int n){

        if(n==1){
/***********SPACE***********/
                return 1; 

        }

        else 
/***********SPACE***********/
                return n+add(n-1);

}

}
