/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

本题将一个整形变量op1的二进制的低3位全部变成1。

-------------------------------------------------------*/

public class Prog1{        
public static void main(String[] args) {
/***********SPACE***********/
        int op1=21;
        int op2=7;
/***********SPACE***********/
        int res;
/***********SPACE***********/
        res=op1|op2;
        System.out.println(res);
}        
}
